CSI API ETABS v1
cDetailing.GetColumnLongRebarData Method
 Retrieves longitudinal rebar data for a column frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetColumnLongRebarData(
	string Name,
	ref int NumberRebarSets,
	ref string[] BarSizeName,
	ref double[] BarArea,
	ref int[] NumberCBars,
	ref int[] NumberR3Bars,
	ref int[] NumberR2Bars,
	ref string[] Location,
	ref double[] ClearCover,
	ref string[] RebarSetGUID
)
Function GetColumnLongRebarData (
	Name As String,
	ByRef NumberRebarSets As Integer,
	ByRef BarSizeName As String(),
	ByRef BarArea As Double(),
	ByRef NumberCBars As Integer(),
	ByRef NumberR3Bars As Integer(),
	ByRef NumberR2Bars As Integer(),
	ByRef Location As String(),
	ByRef ClearCover As Double(),
	ByRef RebarSetGUID As String()
) As Integer
Dim instance As cDetailing
Dim Name As String
Dim NumberRebarSets As Integer
Dim BarSizeName As String()
Dim BarArea As Double()
Dim NumberCBars As Integer()
Dim NumberR3Bars As Integer()
Dim NumberR2Bars As Integer()
Dim Location As String()
Dim ClearCover As Double()
Dim RebarSetGUID As String()
Dim returnValue As Integer
returnValue = instance.GetColumnLongRebarData(Name,
	NumberRebarSets, BarSizeName, BarArea,
	NumberCBars, NumberR3Bars, NumberR2Bars,
	Location, ClearCover, RebarSetGUID)
int GetColumnLongRebarData(
	String^ Name,
	int% NumberRebarSets,
	array<String^>^% BarSizeName,
	array<double>^% BarArea,
	array<int>^% NumberCBars,
	array<int>^% NumberR3Bars,
	array<int>^% NumberR2Bars,
	array<String^>^% Location,
	array<double>^% ClearCover,
	array<String^>^% RebarSetGUID
)
abstract GetColumnLongRebarData :
        Name : string *
        NumberRebarSets : int byref *
        BarSizeName : string[] byref *
        BarArea : float[] byref *
        NumberCBars : int[] byref *
        NumberR3Bars : int[] byref *
        NumberR2Bars : int[] byref *
        Location : string[] byref *
        ClearCover : float[] byref *
        RebarSetGUID : string[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing beam frame object
NumberRebarSets
Type: System.Int32
 Number of longitudinal rebar sets for this beam object
BarSizeName
Type: System.String[]
 Rebar designation
BarArea
Type: System.Double[]
 Individual rebar area
NumberCBars
Type: System.Int32[]
 Total number of rebars in this set (for both circular or rectangular pattern)
NumberR3Bars
Type: System.Int32[]
 Number of rectangular pattern bars along 3 direction (per face including corner bars); zero for circular pattern
NumberR2Bars
Type: System.Int32[]
 Number of rectangular pattern bars along 2 direction (per face including corner bars); zero for circular pattern
Location
Type: System.String[]
 Location of this set of rebars - not currenlty used - left initilaized to blank ""
ClearCover
Type: System.Double[]
 Clear cover from face to longitudinal rebar being specified
RebarSetGUID
Type: System.String[]
 The GUIDs of each of the rebar sets
Return Value
Type: Int32
 Returns zero if the rebar data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace